app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 668017202], ["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "email" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "Foo Bar"], ["email", "foo@bar.com"], ["updated_at", "2018-12-28 09:57:21.873331"], ["id", 1032330268]]
---
   def update
    @user = User.find(params[:id])
    if @user.update_attributes(user_params)